#include "data.h"

extern char token[];
extern int prerow, precol;  //出错前的行号、列号

char* err_msg[] =
{
	/*  0 */    "",
	/*  1 */    "缺少：标识符，或标识符拼写错误！",
	/*  2 */    "缺少：整数，或整数拼写错误！",
	/*  3 */    "缺少：+，或+拼写错误！",
	/*  4 */    "缺少：-，或-拼写错误！",
	/*  5 */    "缺少：*，或*拼写错误！",
	/*  6 */    "缺少：/，或/拼写错误！",
	/*  7 */    "缺少：(，或(拼写错误！",
	/*  8 */    "缺少：)，或)写错误！",
	/*  9 */    "缺少：小数，或小数拼写错误！",
	/* 10 */    "缺少：=，或=拼写错误！",
	/* 11 */    "缺少：<，或<拼写错误！",
	/* 12 */    "缺少：>，或>拼写错误！",
	/* 13 */    "缺少：<=，或<=拼写错误！",
	/* 14 */    "缺少：>=，或>=拼写错误！",
	/* 15 */    "缺少：<>，或<>拼写错误！",
	/* 16 */    "缺少：==，或==拼写错误！",
	/* 17 */    "缺少：and，或and拼写错误！",
	/* 18 */    "缺少：or，或or拼写错误！",
	/* 19 */    "缺少：，或，拼写错误！",
	/* 20 */    "缺少：；或；拼写错误！",
	/* 21 */    "单行注释错误！",
	/* 22 */    "多行注释错误！",
	/* 23 */    "程序尾部出现多余单词！",
	/* 24 */    "非法语句",
	/* 25 */	"",
	/* 26 */	"",
	/* 27 */	"",
	/* 28 */	"",
	/* 29 */	"",
	/* 30 */	"缺少：begin，或begin拼写错误！",
	/* 31 */	"缺少：as，或as拼写错误！",
	/* 32 */	"缺少：sub，或sub拼写错误！",
	/* 33 */	"缺少：end，或end拼写错误！",
	/* 34 */	"缺少：if，或if拼写错误！",
	/* 35 */	"缺少：then，或then拼写错误！",
	/* 36 */	"缺少：else，或else拼写错误！",
	/* 37 */	"缺少：call，或拼写错误！",
	/* 38 */	"缺少：while，或while拼写错误！",
	/* 39 */	"缺少：do，或do拼写错误！",
	/* 40 */	"缺少：integer，或integer拼写错误！",
	/* 41 */	"缺少：float，或float拼写错误！",
	/* 42 */	"缺少：input，或input拼写错误！",
	/* 43 */	"缺少：output，或output拼写错误！",
	/* 44 */	"缺少：var，或var拼写错误！",
	/* 45 */	"缺少：do，或do拼写错误！",
	/* 46 */	"变量未定义",
	/* 47 */	"变量重复定义",
	/* 48 */	"函数未定义",
	/* 49 */	"函数重复定义",
	/* 50 */	"变量类型不匹配",
	/* 51 */	"函数实参与形参的数目不一致",
	/* 51 */	"函数实参与形参的数据类型不一致",
};

void error(int n) {
	if (n > 45 && n < 51) {
		printf("行号：%d  列号：%d  %s %s\n", prerow, precol, token, err_msg[n]);
	}
	else {
		printf("行号：%d  列号：%d  %s\n", prerow, precol, err_msg[n]);
	}
	fclose(fin);
	getchar();
	exit(0);
}
